## Clusters Terraform Plan
  ```terraform
  
#########################################################
##
##   Planning changes for sandboxy environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                        # (19 unchanged elements hidden)
                        {
                            remoteRef = {
                                key      = "TF_VAR_VAULT_TOKEN"
                                property = "data.TF_VAR_VAULT_TOKEN"
                            }
                            secretKey = "TF_VAR_VAULT_TOKEN"
                        },
                      + {
                          + remoteRef = {
                              + key      = "TF_VAR_pm_api_token_id"
                              + property = "data.TF_VAR_pm_api_token_id"
                            }
                          + secretKey = "TF_VAR_pm_api_token_id"
                        },
                      + {
                          + remoteRef = {
                              + key      = "TF_VAR_pm_api_token_secret"
                              + property = "data.TF_VAR_pm_api_token_secret"
                            }
                          + secretKey = "TF_VAR_pm_api_token_secret"
                        },
                        {
                            remoteRef = {
                                key      = "VAULT_TOKEN"
                                property = "data.VAULT_TOKEN"
                            }
                            secretKey = "VAULT_TOKEN"
                        },
                        # (1 unchanged element hidden)
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                        # (19 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "TF_VAR_VAULT_TOKEN"
                                metadataPolicy     = "None"
                                property           = "data.TF_VAR_VAULT_TOKEN"
                                version            = null
                            }
                            secretKey = "TF_VAR_VAULT_TOKEN"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "VAULT_TOKEN" -> "TF_VAR_pm_api_token_id"
                              ~ property           = "data.VAULT_TOKEN" -> "data.TF_VAR_pm_api_token_id"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "VAULT_TOKEN" -> "TF_VAR_pm_api_token_id"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "github_token" -> "TF_VAR_pm_api_token_secret"
                              ~ property           = "data.github_token" -> "data.TF_VAR_pm_api_token_secret"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "github_token" -> "TF_VAR_pm_api_token_secret"
                            # (1 unchanged attribute hidden)
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "VAULT_TOKEN"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.VAULT_TOKEN"
                              + version            = (known after apply)
                            }
                          + secretKey = "VAULT_TOKEN"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "github_token"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.github_token"
                              + version            = (known after apply)
                            }
                          + secretKey = "github_token"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

  # module.kubevirt_operator[0].kubectl_manifest.cdi_operator["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/cdis.cdi.kubevirt.io"] will be updated in-place
  ~ resource "kubectl_manifest" "cdi_operator" {
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/cdis.cdi.kubevirt.io"
        name                    = "cdis.cdi.kubevirt.io"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

  # module.external_secrets[0].module.vault_token_secret.kubernetes_secret.this[0] will be updated in-place
  ~ resource "kubernetes_secret" "this" {
      ~ data                           = (sensitive value)
        id                             = "external-secrets/vault-token"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

#########################################################
##
##   Planning changes for tools environment...
##
#########################################################

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

  ```
  
  Plan exit code: 0
  